cask_args appdir: "/Applications"

# tools
brew 'ack'
brew 'ansible'
brew 'aws-shell'
brew 'awscli'
brew 'bash-completion'
brew 'bash'
brew 'coreutils'
brew 'ctags'
brew 'git'
brew 'grc'
brew 'htop'
brew 'hub'
brew 'jq'
brew 'mas'
brew 'mtr'
brew 'nmap'
brew 'nvim'
brew 'openssl'
brew 'tmux'
brew 'tree'
brew 'unrar'
brew 'watch'
brew 'wget'

# dev langs
tap 'homebrew/cask'
tap 'homebrew/cask-versions'
cask 'java8'
brew 'go'
brew 'node'
brew 'php'

# VMs and containers
cask 'docker'
cask 'vagrant'
cask 'virtualbox'

# apps
cask 'caskroom/versions/firefox-developer-edition'
cask 'google-chrome'
cask 'intellij-idea'
cask 'iterm2'
cask 'keepingyouawake'
cask 'postman'
cask 'sequel-pro'
cask 'visual-studio-code'
cask 'visualvm'

# appstore
mas '1Password', id: 1333542190
mas 'Bear', id: 1091189122
